In [92]:
import pandas as pd

In [93]:
from pandas import Series, DataFrame

In [4]:
obj = pd.Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3])

In [7]:
obj.index # como range(4)

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj2['a']

-5

In [12]:
obj2['d'] = 6

In [13]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

In [19]:
sdata = {'Florança': 3500, 'Toscana': 71000, 'Milão': 16000, 'Roma': 5000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Florança     3500
Toscana     71000
Milão       16000
Roma         5000
dtype: int64

In [22]:
states = ['Toscana', 'Florença', 'Milão', 'Roma']

In [23]:
obj4 = pd.Series(sdata, index=states)

In [24]:
obj4

Toscana     71000.0
Florença        NaN
Milão       16000.0
Roma         5000.0
dtype: float64

In [25]:
pd.isnull(obj4)

Toscana     False
Florença     True
Milão       False
Roma        False
dtype: bool

In [26]:
pd.notnull(obj4)

Toscana      True
Florença    False
Milão        True
Roma         True
dtype: bool

In [28]:
obj4.isnull()

Toscana     False
Florença     True
Milão       False
Roma        False
dtype: bool

In [29]:
obj3

Florança     3500
Toscana     71000
Milão       16000
Roma         5000
dtype: int64

In [30]:
obj4

Toscana     71000.0
Florença        NaN
Milão       16000.0
Roma         5000.0
dtype: float64

In [31]:
obj3 + obj4

Florança         NaN
Florença         NaN
Milão        32000.0
Roma         10000.0
Toscana     142000.0
dtype: float64

In [32]:
obj4.name = 'population'

In [34]:
obj4.index.name = 'states'

In [35]:
obj4

states
Toscana     71000.0
Florença        NaN
Milão       16000.0
Roma         5000.0
Name: population, dtype: float64

In [36]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [37]:
obj.index = ['Nick','Malik','Kletus','Trask']

In [38]:
obj

Nick      4
Malik     7
Kletus   -5
Trask     3
dtype: int64

In [39]:
data = {'states': ['San Fierro', 'San Fierro', 'San Fierro', 'Las Venturas', 'Las Venturas', 'Las Venturas'],
       'year':[2000, 2001, 2002, 2001, 2002, 2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [40]:
frame

         states  year  pop
0    San Fierro  2000  1.5
1    San Fierro  2001  1.7
2    San Fierro  2002  3.6
3  Las Venturas  2001  2.4
4  Las Venturas  2002  2.9
5  Las Venturas  2003  3.2

In [41]:
frame.head()

         states  year  pop
0    San Fierro  2000  1.5
1    San Fierro  2001  1.7
2    San Fierro  2002  3.6
3  Las Venturas  2001  2.4
4  Las Venturas  2002  2.9

In [42]:
pd.DataFrame(data,columns=['year', 'state','pop'])

   year state  pop
0  2000   NaN  1.5
1  2001   NaN  1.7
2  2002   NaN  3.6
3  2001   NaN  2.4
4  2002   NaN  2.9
5  2003   NaN  3.2

In [43]:
frame2 = pd.DataFrame(data, columns=['year', 'states', 'pop', 'debt'],
                     ......:index=['one', 'two','three', 'four','five', 'six'])

In [44]:
frame2

       year        states  pop debt
one    2000    San Fierro  1.5  NaN
two    2001    San Fierro  1.7  NaN
three  2002    San Fierro  3.6  NaN
four   2001  Las Venturas  2.4  NaN
five   2002  Las Venturas  2.9  NaN
six    2003  Las Venturas  3.2  NaN

In [45]:
frame2.columns

Index(['year', 'states', 'pop', 'debt'], dtype='object')

In [48]:
frame2['states']

one        San Fierro
two        San Fierro
three      San Fierro
four     Las Venturas
five     Las Venturas
six      Las Venturas
Name: states, dtype: object

In [49]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [50]:
frame2.loc['three']

year            2002
states    San Fierro
pop              3.6
debt             NaN
Name: three, dtype: object

In [51]:
frame2['debt'] = 16.5

In [52]:
frame2

       year        states  pop  debt
one    2000    San Fierro  1.5  16.5
two    2001    San Fierro  1.7  16.5
three  2002    San Fierro  3.6  16.5
four   2001  Las Venturas  2.4  16.5
five   2002  Las Venturas  2.9  16.5
six    2003  Las Venturas  3.2  16.5

In [56]:
val = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [57]:
frame2['debt']= val

In [58]:
frame2

       year        states  pop  debt
one    2000    San Fierro  1.5   NaN
two    2001    San Fierro  1.7  -1.2
three  2002    San Fierro  3.6   NaN
four   2001  Las Venturas  2.4  -1.5
five   2002  Las Venturas  2.9  -1.7
six    2003  Las Venturas  3.2   NaN

In [59]:
frame2['eastern'] = frame2.states == 'San Fierro'

In [60]:
frame2

       year        states  pop  debt  eastern
one    2000    San Fierro  1.5   NaN     True
two    2001    San Fierro  1.7  -1.2     True
three  2002    San Fierro  3.6   NaN     True
four   2001  Las Venturas  2.4  -1.5    False
five   2002  Las Venturas  2.9  -1.7    False
six    2003  Las Venturas  3.2   NaN    False

In [61]:
del frame2['eastern']

In [62]:
frame2.columns

Index(['year', 'states', 'pop', 'debt'], dtype='object')

In [63]:
pop = {'Las Venturas': {2006: 2.4, 2000:2.9},
      ......:'San Fierro':{2000: 1.5, 2006: 1.7, 2000:3.6}}

In [64]:
frame3 = pd.DataFrame(pop)

In [65]:
frame3

      Las Venturas  San Fierro
2006           2.4         1.7
2000           2.9         3.6

In [66]:
frame3.T

              2006  2000
Las Venturas   2.4   2.9
San Fierro     1.7   3.6

In [69]:
pd.DataFrame(pop, index=[2000,2002,2006])

      Las Venturas  San Fierro
2000           2.9         3.6
2002           NaN         NaN
2006           2.4         1.7

In [70]:
frame3.index.name = 'year'; frame3.columns.name = 'states'

In [71]:
frame3

states  Las Venturas  San Fierro
year
2006             2.4         1.7
2000             2.9         3.6

In [72]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6]])

In [73]:
frame2.values

array([[2000, 'San Fierro', 1.5, nan],
       [2001, 'San Fierro', 1.7, -1.2],
       [2002, 'San Fierro', 3.6, nan],
       [2001, 'Las Venturas', 2.4, -1.5],
       [2002, 'Las Venturas', 2.9, -1.7],
       [2003, 'Las Venturas', 3.2, nan]], dtype=object)

In [74]:
obj = pd.Series(range(3), index=['a','b','c'])

In [75]:
index = obj.index

In [76]:
index

Index(['a', 'b', 'c'], dtype='object')

In [77]:
index[1:]

Index(['b', 'c'], dtype='object')

In [78]:
'd' # TypeError

'd'

In [86]:
frame3.columns

Index(['Las Venturas', 'San Fierro'], dtype='object', name='states')

In [87]:
'Las Venturas' in frame3.columns

True

In [90]:
2001 in frame3.index

False

In [96]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [97]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [99]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [100]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [101]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [102]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [103]:
obj3 = pd.Series(['green','purple','black'], index=[0,2,4])

In [104]:
obj3

0     green
2    purple
4     black
dtype: object

In [105]:
obj3.reindex(range(6), method='ffill')

0     green
1     green
2    purple
3    purple
4     black
5     black
dtype: object

In [110]:
frame

         states  year  pop
0    San Fierro  2000  1.5
1    San Fierro  2001  1.7
2    San Fierro  2002  3.6
3  Las Venturas  2001  2.4
4  Las Venturas  2002  2.9
5  Las Venturas  2003  3.2

In [111]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [112]:
frame2

  states  year  pop
a    NaN   NaN  NaN
b    NaN   NaN  NaN
c    NaN   NaN  NaN
d    NaN   NaN  NaN